"""浅いコピー(shallow copy)"""
"""「浅いコピー」は, b = a[:]またはb = copy.copy(a)の書式でおこなう
・一番上の要素を入れ替える場合は連動しない
・深い部分の要素を変更する場合が連動する
"""

import copy
"""1.aとbが連動しないケース"""
"""
    (1)変数の再定義
"""
#Code07

a = [1, [2], [3, [4]]]
b = a[:]
a = [5, [6], [7, [8]]]
print("a, b = ", a, b)
"""出力結果
a, b =  [5, [6], [7, [8]]] [1, [2], [3, [4]]]
"""

"""
    (2)リストの一番上の要素を変更
"""
c = [1, [2], [3, [4]]]
d = c[:]
c[0] = 5; c[1] = [6]; c[2] = [7, [8]]
print("c, d = ", c, d)
"""出力結果
c, d =  [5, [6], [7, [8]]] [1, [2], [3, [4]]]
"""

"""2.aとbが連動するケース"""
"""
    (1)深い部分要素変更(もっとも上の部分は連動にならない)
"""
e = [1, [2], [3, [4]]]
f = e[:]
e[0] = 5; e[1][0] = 6; e[2][0] = 7; e[2][1][0] = 8
print("e, f = ", e, f)

"""深いコピー(deep copy)"""
"""「深いコピー」はb = deepcopy(a)の書式に従う
・全ての変更が連動せず、それぞれ独立した変数にすることができる
"""
"""1.aとbが連動しないケース"""
"""
    (1)全ての変更が連動しない
"""
g = [1, [2], [3, [4]]]
h = copy.deepcopy(g)
g = [5, [6], [7, [8]]]
print("g, h = ", g, h)

i = [1, [2], [3, [4]]]
j = copy.deepcopy(i)
i[0] = 5; i[1] = [6]; i[2] = [7, [8]]
print("i, j = " , i, j)

k = [1, [2], [3, [4]]]
l = copy.deepcopy(k)
k[0] = 5; k[1][0] = 6; k[2][0] = 7; k[2][1][0] = 8
print("k, l = " , k, l)
